TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_РезультатыНормативнойСертификацииНоменклатуры/гкс_РезультатыНормативнойСертификацииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_РезультатыНормативнойСертификацииНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Базис</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГОСТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтклонятьКачество</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИскатьВнешниеПробы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоказательАнализа</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначениеИспользованияКачества</name>
    <comment>ERP-2184</comment>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <comment>ERP-2184</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СегментацияКачестваНоменклатуры/гкс_СегментацияКачестваНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СегментацияКачестваНоменклатуры</name>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СлужебнаяНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ПриоритетыПоказателейКачества/гкс_ПриоритетыПоказателейКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ПриоритетыПоказателейКачества</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ПоказателиУсиленногоКонтроляПоРегистрации/гкс_ПоказателиУсиленногоКонтроляПоРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ПоказателиУсиленногоКонтроляПоРегистрации</name>
  <resources>
    <name>ЗначениеПоказателяМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоказателяМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Базис</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СостояниеКачества</name>
    <type>
      <types>EnumRef.гкс_СостоянияКачества</types>
    </type>
  </resources>
  <resources>
    <name>ОтклонятьКачество</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныеСутки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛабораторныйАнализ</name>
    <type>
      <types>DocumentRef.гкс_ЛабораторныйАнализ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначениеИспользования</name>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СвязьРегистрацииИТранспортногоДокумента/гкс_СвязьРегистрацииИТранспортногоДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СвязьРегистрацииИТранспортногоДокумента</name>
  <comment>Транспортные документы регистрации</comment>
  <resources>
    <name>ТранспортныйДокумент</name>
    <type>
      <types>DocumentRef.гкс_ТранспортныйДокумент</types>
    </type>
  </resources>
  <resources>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаПеревозку</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ВнешниеПробыПоЗаявкамНаПеревозку/гкс_ВнешниеПробыПоЗаявкамНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ВнешниеПробыПоЗаявкамНаПеревозку</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВнешняяПроба</name>
    <type>
      <types>DocumentRef.гкс_ВнешняяПроба</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерЗерновоза</name>
    <comment>Для поиска</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПрицепа</name>
    <comment>Для поиска</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПогрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сюрвейер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначениеИспользованияКачества</name>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_НазначенияИспользованияКачества/гкс_НазначенияИспользованияКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_НазначенияИспользованияКачества</name>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ЭлеваторВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>ЛаборантВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>КомпозитВнешниеПробыНаТысячуТон</name>
  </enumValues>
  <enumValues>
    <name>ПромежуточныйКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйАнализ</name>
  </enumValues>
  <enumValues>
    <name>ПерепроверкаВнешнихПроб</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыПроб/гкс_ТипыПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыПроб</name>
  <enumValues>
    <name>Единичная</name>
  </enumValues>
  <enumValues>
    <name>Композитная</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ЗаявкаНаПеревозку/гкс_ЗаявкаНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ЗаявкаНаПеревозку</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияНазначения</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОтправления</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоНазначения</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Сюрвейер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/CommonModules/гкс_РаботаСПоказателямиНоменклатуры/Module.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

// Производит поиск внешней пробы
//
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - 
//
// Возвращаемое значение: 
//  Неопределено, ДеревоЗначений:
//		- Показатель - СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры - показатель качества
//		- ЕстьВнешний - Булево - Истина, если для показателя определиласт внешняя проба
//		- ВнешняяПроба - ДокументСсылка.гкс_ВнешняяПроба - Документ внешней пробы
//      - ЗначениеПоказателя - число - значение показателей внешней пробы
//
Функция ПоискДокументаВнешнейПробы(ДокументРегистрации) Экспорт
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ТочкаМаршрута", "ТочкаМаршрута");
	Реквизиты.Вставить("Номенклатура", "Номенклатура");
	Реквизиты.Вставить("ВидПеревозки", "ВидПеревозки");	
	ДанныеРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРегистрации, Реквизиты);
	
	Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ТочкаМаршрута", ДанныеРегистрации.ТочкаМаршрута);
	Запрос.УстановитьПараметр("Номенклатура", ДанныеРегистрации.Номенклатура);
	Запрос.УстановитьПараметр("ВидПеревозки", ДанныеРегистрации.ВидПеревозки);                                                                   
	Запрос.УстановитьПараметр("ДокументРегистрации", ДокументРегистрации);	
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
		
	Если ДанныеРегистрации.ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт Тогда
		
		ОпределитьУсловияПоискаВнешнейПробыЖД(Запрос);	
		
	ИначеЕсли ДанныеРегистрации.ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль Тогда
		
		ОпределитьУсловияПоискаВнешнейПробыАВто(Запрос);
			
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;	
			
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НормативнаяСертификация.ПоказательАнализа КАК Показатель
		|ПОМЕСТИТЬ ВТ_ПоказателиСпецификации
		|ИЗ
		|	РегистрСведений.гкс_РезультатыНормативнойСертификацииНоменклатуры.СрезПоследних(
		|			&Период,
		|			Номенклатура = &Номенклатура
		|				И ТочкаМаршрута = &ТочкаМаршрута
		|				И ВидПеревозки = &ВидПеревозки
		|				И НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.Приемка)) КАК НормативнаяСертификация
		|ГДЕ
		|	НормативнаяСертификация.ПериодС <= &Период
		|	И НормативнаяСертификация.ПериодПо >= НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	И НормативнаяСертификация.ИскатьВнешниеПробы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПоказателиСпецификации.Показатель КАК Показатель,
		|	НЕ ВТ_ПоказателиВнешнейПробы.Показатель ЕСТЬ NULL КАК ЕстьВнешний,
		|	ЕСТЬNULL(ВТ_ПоказателиВнешнейПробы.ВнешняяПроба, ЗНАЧЕНИЕ(Документ.гкс_ВнешняяПроба.ПустаяСсылка)) КАК ВнешняяПроба,
		|	ЕСТЬNULL(ВТ_ПоказателиВнешнейПробы.ЗначениеПоказателя, 0) КАК ЗначениеПоказателя,
		|	ЕСТЬNULL(ВТ_ПоказателиВнешнейПробы.ЗаявкаНаПеревозку, ЗНАЧЕНИЕ(Документ.гкс_ЗаявкаНаПеревозку.ПустаяСсылка)) КАК ЗаявкаНаПеревозку,
		|	ЕСТЬNULL(ВТ_ПоказателиВнешнейПробы.ТранспортныйДокумент, ЗНАЧЕНИЕ(Документ.гкс_ТранспортныйДокумент.ПустаяСсылка)) КАК ТранспортныйДокумент
		|ИЗ
		|	ВТ_ПоказателиСпецификации КАК ВТ_ПоказателиСпецификации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказателиВнешнейПробы КАК ВТ_ПоказателиВнешнейПробы
		|		ПО ВТ_ПоказателиСпецификации.Показатель = ВТ_ПоказателиВнешнейПробы.Показатель
		|ИТОГИ
		|	МИНИМУМ(ЕстьВнешний)
		|ПО
		|	ОБЩИЕ";
			
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;	
	
КонецФункции

// Возвращает документ внешней пробы ждя регистрации
//
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - 
//
// Возвращаемое значение: 
//	ВнешняяПроба - ДокументСсылка.гкс_ВнешняяПроба - Документ внешней пробы
//
Функция ДокументВнешнейПробы(ДокументРегистрации) Экспорт
	
	ЗначенияВнешнейПробы = ПоискДокументаВнешнейПробы(ДокументРегистрации);	
	Если Не ЗначениеЗаполнено(ЗначенияВнешнейПробы) Тогда
		Возврат Документы.гкс_ВнешняяПроба.ПустаяСсылка();
	КонецЕсли;	
		
	НомерИтоговогоУзла = 0;
	ИтоговыйУзел = ЗначенияВнешнейПробы.Строки[НомерИтоговогоУзла];	
		
	Если ИтоговыйУзел.ЕстьВнешний Тогда
		ДанныеВнешнейПробы = ИтоговыйУзел.Строки;
		Результат = ДанныеВнешнейПробы[0].ВнешняяПроба;	
	Иначе	
		Результат = Документы.гкс_ВнешняяПроба.ПустаяСсылка();
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	

// Определяет допустимые интервалы нормативной спецификации.
// 
// Параметры:
//  ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута - Точка маршрута
//  ВидПеревозки - ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки - Вид перевозки
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
//  ДатаАнализа - Дата - Дата анализа
//  НазначениеИспользованияКачества - ПеречислениеСсылка.гкс_НазначенияИспользованияКачества 
//  НормативнаяСертификация - ДокументСсылка.гкс_НормативнаяСертификацияНоменклатуры 
// 
// Возвращаемое значение:
//  Неопределено, ТаблицаЗначений - Допустимые интервалы нормативной спецификации
//
Функция ДопустимыеИнтервалыНормативнойСпецификации(ТочкаМаршрута, ВидПеревозки, Номенклатура, ДатаАнализа,
	НазначениеИспользованияКачества, НормативнаяСертификация = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НормативныеЗначения.ПоказательАнализа КАК Показатель,
		|	МАКСИМУМ(НормативныеЗначения.ЗначениеПоказателя) КАК ЗначениеПоказателяМин,
		|	МАКСИМУМ(НормативныеЗначения.МаксимальноеЗначение) КАК ЗначениеПоказателяМакс,
		|	МАКСИМУМ(НормативныеЗначения.Базис) КАК Базис,
		|	НормативныеЗначения.ОтклонятьКачество КАК ОтклонятьКачество
		|ПОМЕСТИТЬ ВТ_НормативныеЗначенияДляНоменклатуры
		|ИЗ
		|	РегистрСведений.гкс_РезультатыНормативнойСертификацииНоменклатуры.СрезПоследних(
		|			&ДатаАнализа,
		|			Номенклатура = &Номенклатура
		|				И ТочкаМаршрута = &ТочкаМаршрута
		|				И ВидПеревозки = &ВидПеревозки
		|				И НазначениеИспользованияКачества = &НазначениеИспользования
		|				И (ПериодС <= &ДатаАнализа
		|					ИЛИ ПериодС = ДАТАВРЕМЯ(1, 1, 1))
		|				И (ПериодПо >= НАЧАЛОПЕРИОДА(&ДатаАнализа, ДЕНЬ)
		|					ИЛИ ПериодПо = ДАТАВРЕМЯ(1, 1, 1))) КАК НормативныеЗначения
		|
		|СГРУППИРОВАТЬ ПО
		|	НормативныеЗначения.ПоказательАнализа,
		|	НормативныеЗначения.ОтклонятьКачество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НормативныеЗначенияДляНоменклатуры.Показатель КАК Показатель,
		|	ЕСТЬNULL(НормативнаяСертификацияСлужебнойНоменклатуры.ЗначениеПоказателя, ВТ_НормативныеЗначенияДляНоменклатуры.ЗначениеПоказателяМин) КАК ЗначениеПоказателяМин,
		|	ЕСТЬNULL(НормативнаяСертификацияСлужебнойНоменклатуры.МаксЗначениеПоказателя, ВТ_НормативныеЗначенияДляНоменклатуры.ЗначениеПоказателяМакс) КАК ЗначениеПоказателяМакс,
		|	ЕСТЬNULL(НормативнаяСертификацияСлужебнойНоменклатуры.Базис, ВТ_НормативныеЗначенияДляНоменклатуры.Базис) КАК Базис,
		|	ЕСТЬNULL(НормативнаяСертификацияСлужебнойНоменклатуры.ОтклонятьКачество, ВТ_НормативныеЗначенияДляНоменклатуры.ОтклонятьКачество) КАК ОтклонятьКачество
		|ИЗ
		|	ВТ_НормативныеЗначенияДляНоменклатуры КАК ВТ_НормативныеЗначенияДляНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_ПоказателиАнализовНоменклатуры КАК ПоказателиАнализовНоменклатуры
		|		ПО ВТ_НормативныеЗначенияДляНоменклатуры.Показатель = ПоказателиАнализовНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_НормативнаяСертификацияНоменклатуры.Анализы КАК НормативнаяСертификацияСлужебнойНоменклатуры
		|		ПО (НормативнаяСертификацияСлужебнойНоменклатуры.Ссылка = &СертификацияСлужебнойНоменклатуры)
		|			И ВТ_НормативныеЗначенияДляНоменклатуры.Показатель = НормативнаяСертификацияСлужебнойНоменклатуры.ПоказательАнализа";
	
	
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозки);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);	
	Запрос.УстановитьПараметр("ДатаАнализа", ДатаАнализа);
	Запрос.УстановитьПараметр("СертификацияСлужебнойНоменклатуры", НормативнаяСертификация);
	
	Если Перечисления.гкс_НазначенияИспользованияКачества
			.ЭтоПерепроверкаВнешнихПроб(НазначениеИспользованияКачества) Тогда		
		Запрос.УстановитьПараметр("НазначениеИспользования", 
			Перечисления.гкс_НазначенияИспользованияКачества.Приемка);			
	Иначе	
		Запрос.УстановитьПараметр("НазначениеИспользования", НазначениеИспользованияКачества);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат = Неопределено;
	Иначе
		Результат = РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Дата окончания периода сертификации.
// 
// Возвращаемое значение:
//  Дата - Дата окончания периода сертификации
//
Функция ДатаОкончанияПериодаСертификации() Экспорт
		
	Возврат Константы.гкс_ДатаОкончанияПериодаСертификацииПоУмолчанию.Получить();
	
КонецФункции	

// Возвращает массив нормативных показателей по условиям.
// 
// Параметры:
//  ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута - ПЛК
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
//  ВидПеревозки - ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки - Вид перевозки
//  НазначениеИспользованияКачества - ПеречислениеСсылка.гкс_НазначенияИспользованияКачества - 
//  Период - Неопределено, Дата, Структура - Период
// 
//  Массив из Структура
//			*Показатель - СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры - Показатель усиленного контроля
//			*ЕдиницаИзмерения - СправочникСсылка.УпаковкиЕдиницыИзмерения - единица измерения показателя
//
Функция НормативныеПоказатели(ТочкаМаршрута, Номенклатура, ВидПеревозки, НазначениеИспользованияКачества, 
	Период = Неопределено) Экспорт
	
    УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НормативнаяСертификация.ПоказательАнализа КАК Показатель,
		|	НормативнаяСертификация.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	НормативнаяСертификация.ОтклонятьКачество КАК ОтклонятьКачество,
		|	НормативнаяСертификация.ИскатьВнешниеПробы КАК ИскатьВнешниеПробы
		|ИЗ
		|	РегистрСведений.гкс_РезультатыНормативнойСертификацииНоменклатуры.СрезПоследних(&ДатаОкончания,
		|		Номенклатура = &Номенклатура
		|	И ТочкаМаршрута = &ТочкаМаршрута
		|	И ВидПеревозки = &ВидПеревозки
		|	И НазначениеИспользованияКачества = &НазначениеИспользованияКачества) КАК НормативнаяСертификация
		|ГДЕ
		|	НормативнаяСертификация.ПериодС <= &ДатаНачала
		|	И НормативнаяСертификация.ПериодПо >= НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НормативнаяСертификация.НомерСтроки";
		
	Если ТипЗнч(Период) = Тип("Дата") Тогда

		ДатаНачала = Период;
		ДатаОкончания = Период;

	ИначеЕсли ТипЗнч(Период) = Тип("Структура") 
	И Период.Свойство("ДатаНачала") И Период.Свойство("ДатаОкончания") Тогда

		ДатаНачала = ?(ЗначениеЗаполнено(Период.ДатаНачала), Период.ДатаНачала, ТекущаяДатаСеанса());
		ДатаОкончания = ?(ЗначениеЗаполнено(Период.ДатаОкончания), 
							Период.ДатаОкончания, ДатаОкончанияПериодаСертификации());

	Иначе
		ДатаНачала = ТекущаяДатаСеанса();
		ДатаОкончания = ДатаНачала;
	КонецЕсли;				  
	
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозки);
	Запрос.УстановитьПараметр("НазначениеИспользованияКачества", НазначениеИспользованияКачества);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Данные = РезультатЗапроса.Выгрузить();
		Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(Данные);
	Иначе
		Результат = Новый Массив;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// Подбирает спецификацию по фактическим значениям лабораторного анализа.
// 
// Параметры:
//  ЛабораторныйАнализ - ДокументОбъект.гкс_ЛабораторныйАнализ - лабораторный анализ
// 
// Возвращаемое значение:
// 	ДокументСсылка.гкс_НормативнаяСертификацияНоменклатуры - Нормативная спецификация
//
Функция НормативнаяСертификацияПоФактическомуКачеству(ЛабораторныйАнализ) Экспорт
	
	Если ТипЗнч(ЛабораторныйАнализ.гкс_ДокументРегистрации) <> Тип("ДокументСсылка.гкс_РегистрацияНаПЛК") Тогда
		Возврат Документы.гкс_НормативнаяСертификацияНоменклатуры.ПустаяСсылка();
	КонецЕсли;	
								
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Номенклатура", ЛабораторныйАнализ.Номенклатура);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ЛабораторныйАнализ.ТочкаМаршрута);	
	Запрос.УстановитьПараметр("ВидПеревозки", ЛабораторныйАнализ.гкс_ВидПеревозки);
	Запрос.УстановитьПараметр("НазначениеИспользованияКачества", ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества); 
	
	Запрос.УстановитьПараметр("КачественныеПоказатели", ЛабораторныйАнализ.КачественныеПоказатели.Выгрузить());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛабораторныйАнализКачественныеПоказатели.Показатель КАК Показатель,
	|	ЛабораторныйАнализКачественныеПоказатели.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_РезультатыАнализа
	|ИЗ
	|	&КачественныеПоказатели КАК ЛабораторныйАнализКачественныеПоказатели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Номенклатура КАК Номенклатура,
	|	&ТочкаМаршрута КАК ТочкаМаршрута,
	|	&ВидПеревозки КАК ВидПеревозки,
	|	&НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
	|	ЕСТЬNULL(СегментацияКачестваНоменклатуры.СлужебнаяНоменклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК СлужебнаяНоменклатура
	|ПОМЕСТИТЬ ВТ_КлючиПоиска
	|ИЗ
	|	Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СегментацияКачестваНоменклатуры КАК СегментацияКачестваНоменклатуры
	|		ПО (СегментацияКачестваНоменклатуры.Номенклатура = &Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КлючиПоиска.Номенклатура КАК Номенклатура,
	|	ВТ_КлючиПоиска.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ВТ_КлючиПоиска.ВидПеревозки КАК ВидПеревозки,
	|	ВТ_КлючиПоиска.НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
	|	ВТ_КлючиПоиска.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	НормативнаяСертификацияНоменклатуры.Ссылка КАК НормативнаяСертификация
	|ПОМЕСТИТЬ ВТ_КлючиПоискаИСпецификация
	|ИЗ
	|	ВТ_КлючиПоиска КАК ВТ_КлючиПоиска
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НормативнаяСертификацияНоменклатуры КАК НормативнаяСертификацияНоменклатуры
	|		ПО ВТ_КлючиПоиска.ТочкаМаршрута = НормативнаяСертификацияНоменклатуры.ТочкаМаршрута
	|			И ВТ_КлючиПоиска.ВидПеревозки = НормативнаяСертификацияНоменклатуры.гкс_ВидПеревозки
	|			И ВТ_КлючиПоиска.НазначениеИспользованияКачества = НормативнаяСертификацияНоменклатуры.гкс_НазначениеИспользованияКачества
	|			И ВТ_КлючиПоиска.СлужебнаяНоменклатура = НормативнаяСертификацияНоменклатуры.Номенклатура
	|			И (НормативнаяСертификацияНоменклатуры.Проведен)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КлючиПоискаИСпецификация.Номенклатура КАК Номенклатура,
	|	ВТ_КлючиПоискаИСпецификация.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	ВТ_КлючиПоискаИСпецификация.НормативнаяСертификация КАК НормативнаяСертификация,
	|	НормативнаяСертификацияНоменклатурыАнализы.ПоказательАнализа КАК Показатель,
	|	НормативнаяСертификацияНоменклатурыАнализы.ЗначениеПоказателя КАК ЗначениеМин,
	|	НормативнаяСертификацияНоменклатурыАнализы.МаксЗначениеПоказателя КАК ЗначениеМакс,
	|	ЕСТЬNULL(ПриоритетыПоказателейКачества.Приоритет, 0) КАК Приоритет,
	|	ВТ_РезультатыАнализа.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ТаблицаПодбора
	|ИЗ
	|	ВТ_КлючиПоискаИСпецификация КАК ВТ_КлючиПоискаИСпецификация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НормативнаяСертификацияНоменклатуры.Анализы КАК НормативнаяСертификацияНоменклатурыАнализы
	|		ПО ВТ_КлючиПоискаИСпецификация.НормативнаяСертификация = НормативнаяСертификацияНоменклатурыАнализы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ПриоритетыПоказателейКачества КАК ПриоритетыПоказателейКачества
	|		ПО (НормативнаяСертификацияНоменклатурыАнализы.ПоказательАнализа = ПриоритетыПоказателейКачества.Показатель)
	|			И ВТ_КлючиПоискаИСпецификация.Номенклатура = ПриоритетыПоказателейКачества.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РезультатыАнализа КАК ВТ_РезультатыАнализа
	|		ПО (НормативнаяСертификацияНоменклатурыАнализы.ПоказательАнализа = ВТ_РезультатыАнализа.Показатель)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПриоритетыПоказателейКачества.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПриоритетыМаксимум
	|ИЗ
	|	РегистрСведений.гкс_ПриоритетыПоказателейКачества КАК ПриоритетыПоказателейКачества
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КлючиПоиска КАК ВТ_КлючиПоиска
	|		ПО (ВТ_КлючиПоиска.Номенклатура = ПриоритетыПоказателейКачества.Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КлючиПоискаИСпецификация.НормативнаяСертификация КАК НормативнаяСертификация,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НормативнаяСертификацияНоменклатурыАнализы.ПоказательАнализа) КАК КоличествоПоказателей
	|ПОМЕСТИТЬ ВТ_ИтогиПоСпецификации
	|ИЗ
	|	ВТ_КлючиПоискаИСпецификация КАК ВТ_КлючиПоискаИСпецификация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НормативнаяСертификацияНоменклатуры.Анализы КАК НормативнаяСертификацияНоменклатурыАнализы
	|		ПО ВТ_КлючиПоискаИСпецификация.НормативнаяСертификация = НормативнаяСертификацияНоменклатурыАнализы.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КлючиПоискаИСпецификация.НормативнаяСертификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПодбора.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	ВТ_ТаблицаПодбора.НормативнаяСертификация КАК НормативнаяСертификация,
	|	ВТ_ТаблицаПодбора.Показатель КАК Показатель,
	|	ВТ_ТаблицаПодбора.ЗначениеМин КАК ЗначениеМин,
	|	ВТ_ТаблицаПодбора.ЗначениеМакс КАК ЗначениеМакс,
	|	ВТ_ТаблицаПодбора.Приоритет КАК Приоритет,
	|	ВТ_ТаблицаПодбора.Значение КАК Значение,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаПодбора.ЗначениеМакс > ВТ_ТаблицаПодбора.Значение
	|				И ВТ_ТаблицаПодбора.Значение >= ВТ_ТаблицаПодбора.ЗначениеМин
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВходитВДиапазон,
	|	ВЫБОР
	|		КОГДА ВТ_ПриоритетыМаксимум.Приоритет = ВТ_ТаблицаПодбора.Приоритет
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВысшийПриоритет,
	|	ЕСТЬNULL(ВТ_ИтогиПоСпецификации.КоличествоПоказателей, 0) КАК КоличествоПоказателей
	|ПОМЕСТИТЬ ВТ_ТаблицаОценок
	|ИЗ
	|	ВТ_ТаблицаПодбора КАК ВТ_ТаблицаПодбора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогиПоСпецификации КАК ВТ_ИтогиПоСпецификации
	|		ПО ВТ_ТаблицаПодбора.НормативнаяСертификация = ВТ_ИтогиПоСпецификации.НормативнаяСертификация,
	|	ВТ_ПриоритетыМаксимум КАК ВТ_ПриоритетыМаксимум
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаОценок.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	ВТ_ТаблицаОценок.НормативнаяСертификация КАК НормативнаяСертификация,
	|	СУММА(ВТ_ТаблицаОценок.ВходитВДиапазон * ВТ_ТаблицаОценок.ВысшийПриоритет * ВТ_ТаблицаОценок.Приоритет) + ВЫБОР
	|		КОГДА СУММА(ВТ_ТаблицаОценок.ВходитВДиапазон) = МАКСИМУМ(ВТ_ТаблицаОценок.КоличествоПоказателей)
	|				И МАКСИМУМ(ВТ_ТаблицаОценок.КоличествоПоказателей) <> 0
	|			ТОГДА 10
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Коэффициент
	|ПОМЕСТИТЬ ВТ_Расчет
	|ИЗ
	|	ВТ_ТаблицаОценок КАК ВТ_ТаблицаОценок
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаОценок.СлужебнаяНоменклатура,
	|	ВТ_ТаблицаОценок.НормативнаяСертификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_Расчет.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	ВТ_Расчет.НормативнаяСертификация КАК НормативнаяСертификация,
	|	ВТ_Расчет.Коэффициент КАК Коэффициент
	|ИЗ
	|	ВТ_Расчет КАК ВТ_Расчет
	|ГДЕ
	|	ВТ_Расчет.Коэффициент <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Коэффициент УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.НормативнаяСертификация;
	Иначе	
		Результат = Документы.гкс_НормативнаяСертификацияНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

// Показатели усиленного контроля.
// НазначениеИспользования - ПеречислениеСсылка.гкс_НазначенияИспользованияКачества -
// ЛабораторныйАнализ Лабораторный анализ
// 
// Параметры:
//  РегистрацияНаПЛК Регистрация на ПЛК
//  НазначениеИспользования Назначение использования
// 
// Возвращаемое значение:
//  Массив из Структура - *Показатель - СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры - Показатель усиленного контроля
// *ЕдиницаИзмерения - СправочникСсылка.УпаковкиЕдиницыИзмерения - единица измерения показателя
Функция ПоказателиУсиленногоКонтроля(РегистрацияНаПЛК, НазначениеИспользования) Экспорт
	
	Результат = Новый Массив;
	
	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьУсиленныйКонтрольКачества") Тогда
		Возврат Результат;	
	КонецЕсли;	
	
	ТипПробы = Неопределено;
	ДокументыРегистрации = Неопределено;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПоказателиУсиленногоКонтроляПоРегистрации.Показатель КАК Показатель,
		|	ПоказателиАнализовНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации КАК ПоказателиУсиленногоКонтроляПоРегистрации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_ПоказателиАнализовНоменклатуры КАК ПоказателиАнализовНоменклатуры
		|		ПО ПоказателиУсиленногоКонтроляПоРегистрации.Показатель = ПоказателиАнализовНоменклатуры.Ссылка
		|ГДЕ
		|	ПоказателиУсиленногоКонтроляПоРегистрации.ДокументРегистрации В (&ДокументыРегистрации)
		|	И ПоказателиУсиленногоКонтроляПоРегистрации.НазначениеИспользования = &НазначениеИспользования
		|	И ПоказателиУсиленногоКонтроляПоРегистрации.ТипПробы = &ТипПробы";
	
	Запрос.УстановитьПараметр("НазначениеИспользования", НазначениеИспользования);
	
	Если ТипЗнч(РегистрацияНаПЛК) = Тип("ДокументСсылка.гкс_РегистрацияНаПЛК") Тогда
		ТипПробы = Перечисления.гкс_ТипыПроб.Единичная;

		ДокументыРегистрации = Новый ТаблицаЗначений;
		ДокументыРегистрации.Колонки.Добавить("ДокументРегистрации",
			Новый ОписаниеТипов("ДокументСсылка.гкс_РегистрацияНаПЛК"));
		НоваяСтрока = ДокументыРегистрации.Добавить();
		НоваяСтрока.ДокументРегистрации = РегистрацияНаПЛК;
	Иначе
		ТипПробы = Перечисления.гкс_ТипыПроб.Композитная;
		ДокументыРегистрации = РегистрацияНаПЛК.СписокРегистраций.Выгрузить( ,"ДокументРегистрации");
	КонецЕсли;

	Запрос.УстановитьПараметр("ДокументыРегистрации", ДокументыРегистрации);
	Запрос.УстановитьПараметр("ТипПробы", ТипПробы);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Данные = РезультатЗапроса.Выгрузить();
		Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(Данные);
	Иначе
		Результат = Новый Массив;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОпределитьУсловияПоискаВнешнейПробыЖД(Запрос)
	
	Запрос.УстановитьПараметр("ВидВнешнейПробы", 
			Перечисления.гкс_НазначенияИспользованияКачества.КомпозитВнешниеПробыНаТысячуТон);
			
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвязьРегистрацииИТранспортногоДокумента.ТранспортноеСредство КАК ТранспортноеСредство,
		|	СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	ТранспортныйДокументТранспортныеСредства.Номенклатура КАК Номенклатура,
		|	ЗаявкиНаПеревозку.Номер КАК НомерЗаявки,
		|	ЗаявкиНаПеревозку.Ссылка КАК ЗаявкаНаПеревозку,
		|	РегистрацияНаПЛК.ВидПеревозки КАК ВидПеревозки
		|ПОМЕСТИТЬ ВТ_УсловияПоиска
		|ИЗ
		|	РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК СвязьРегистрацииИТранспортногоДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ТранспортныйДокумент.ТранспортныеСредства КАК ТранспортныйДокументТранспортныеСредства
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЗаявкаНаПеревозку КАК ЗаявкиНаПеревозку
		|			ПО ТранспортныйДокументТранспортныеСредства.Заявка = ЗаявкиНаПеревозку.Ссылка
		|		ПО СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент = ТранспортныйДокументТранспортныеСредства.Ссылка
		|			И СвязьРегистрацииИТранспортногоДокумента.ТранспортноеСредство = ТранспортныйДокументТранспортныеСредства.ТранспортноеСредство
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
		|		ПО СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
		|ГДЕ
		|	СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации = &ДокументРегистрации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнешниеПробыПоЗаявкам.Показатель КАК Показатель,
		|	ВнешниеПробыПоЗаявкам.ВнешняяПроба КАК ВнешняяПроба,
		|	ВнешниеПробыПоЗаявкам.ЗначениеПоказателя КАК ЗначениеПоказателя,
		|	ВТ_УсловияПоиска.ЗаявкаНаПеревозку КАК ЗаявкаНаПеревозку,
		|	ВТ_УсловияПоиска.ТранспортныйДокумент КАК ТранспортныйДокумент
		|ПОМЕСТИТЬ ВТ_ПоказателиВнешнейПробы
		|ИЗ
		|	ВТ_УсловияПоиска КАК ВТ_УсловияПоиска
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ВнешниеПробыПоЗаявкамНаПеревозку КАК ВнешниеПробыПоЗаявкам
		|		ПО (ВнешниеПробыПоЗаявкам.ВидПеревозки = ВТ_УсловияПоиска.ВидПеревозки)
		|			И (ВнешниеПробыПоЗаявкам.ТранспортноеСредство = ВТ_УсловияПоиска.ТранспортноеСредство)
		|			И (ВнешниеПробыПоЗаявкам.Номенклатура = ВТ_УсловияПоиска.Номенклатура)
		|			И (ВнешниеПробыПоЗаявкам.НомерЗаявки = ВТ_УсловияПоиска.НомерЗаявки)
		|ГДЕ
		|	ВнешниеПробыПоЗаявкам.НазначениеИспользованияКачества = &ВидВнешнейПробы";
	
КонецПроцедуры

Процедура ОпределитьУсловияПоискаВнешнейПробыАвто(Запрос)

	Запрос.УстановитьПараметр("ВидВнешнейПробы", 
			Перечисления.гкс_НазначенияИспользованияКачества.ЛаборантВнешниеПробы);
			
	Запрос.Текст = 	
		"ВЫБРАТЬ
		|	РегистрацияНаПЛК.ДатаДокументаПоставщика КАК ДатаДокументаПоставщика,
		|	ЕСТЬNULL(ТСЗерновоз.Наименование, """") КАК НомерТС,
		|	ЕСТЬNULL(ТСЗерновоз.Наименование, """") КАК НомерЗерновоза,
		|	ЕСТЬNULL(ТСПрицеп.Наименование, """") КАК НомерПрицепа,
		|	РегистрацияНаПЛК.ВесБрутто КАК ВесБрутто,
		|	РегистрацияНаПЛК.ВесНетто КАК ВесНетто,
		|	РегистрацияНаПЛК.ВесТары КАК ВесТары,
		|	РегистрацияНаПЛК.ТранспортноеСредство КАК ТранспортноеСредство,
		|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура,
		|	РегистрацияНаПЛК.ВидПеревозки КАК ВидПеревозки,
		|	ЕСТЬNULL(СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент, ЗНАЧЕНИЕ(Документ.гкс_ТранспортныйДокумент.ПустаяСсылка)) КАК ТранспортныйДокумент,
		|	ЕСТЬNULL(СвязьРегистрацииИТранспортногоДокумента.ЗаявкаНаПеревозку, ЗНАЧЕНИЕ(Документ.гкс_ЗаявкаНаПеревозку.ПустаяСсылка)) КАК ЗаявкаНаПеревозку
		|ИЗ
		|	Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК ТСПрицеп
		|		ПО РегистрацияНаПЛК.Прицеп = ТСПрицеп.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК ТСЗерновоз
		|		ПО РегистрацияНаПЛК.ТранспортноеСредство = ТСЗерновоз.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК СвязьРегистрацииИТранспортногоДокумента
		|		ПО (СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации = &ДокументРегистрации)
		|ГДЕ
		|	РегистрацияНаПЛК.Ссылка = &ДокументРегистрации";
		
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеЗапроса = РезультатЗапроса.Выгрузить();
	ДанныеРегистрации = ДанныеЗапроса[0];
	
	НомераАвтоИПрицепа = гкс_ПриемкаТранспорта.НомерТранспортногоСредстваВСтруктуру(ДанныеРегистрации.НомерТС);
	
	Если ЗначениеЗаполнено(НомераАвтоИПрицепа.НомерПрицепа) 
		И Не ЗначениеЗаполнено(НомераАвтоИПрицепа.НомерЗерновоза) Тогда
		
		ДанныеРегистрации.НомерЗерновоза = ДанныеРегистрации.НомерТС;
		ДанныеРегистрации.НомерПрицепа = "";
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеРегистрации.НомерПрицепа) Тогда	
		ДанныеРегистрации.НомерЗерновоза = НомераАвтоИПрицепа.НомерЗерновоза;
		
	Иначе	
		ДанныеРегистрации.НомерЗерновоза = НомераАвтоИПрицепа.НомерЗерновоза;
		ДанныеРегистрации.НомерПрицепа = НомераАвтоИПрицепа.НомерПрицепа;
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("КлючиПоиска", ДанныеЗапроса);
	
	КоличествоСимволовДляПоиска = гкс_ПриемкаТранспорта.КоличествоСимволовДляПоискаПоНомеру();
	Запрос.УстановитьПараметр("ПолеПоискаНомерЗерновоза", 
	гкс_ПриемкаТранспорта.ПолеПоискаГосНомер(ДанныеРегистрации.НомерЗерновоза, КоличествоСимволовДляПоиска));
					
	Запрос.Текст = 	
		"ВЫБРАТЬ
		|	КлючиПоиска.ДатаДокументаПоставщика КАК ДатаДокументаПоставщика,
		|	КлючиПоиска.НомерЗерновоза КАК НомерЗерновоза,
		|	КлючиПоиска.НомерПрицепа КАК НомерПрицепа,
		|	КлючиПоиска.ВесБрутто КАК ВесБрутто,
		|	КлючиПоиска.ТранспортноеСредство КАК ТранспортноеСредство,
		|	КлючиПоиска.Номенклатура КАК Номенклатура,
		|	КлючиПоиска.ВидПеревозки КАК ВидПеревозки,
		|	КлючиПоиска.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	КлючиПоиска.ЗаявкаНаПеревозку КАК ЗаявкаНаПеревозку 
		|ПОМЕСТИТЬ ВТ_УсловияПоиска
		|ИЗ
		|	&КлючиПоиска КАК КлючиПоиска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнешниеПробыПоЗаявкам.Показатель КАК Показатель,
		|	ВнешниеПробыПоЗаявкам.ВнешняяПроба КАК ВнешняяПроба,
		|	ВнешниеПробыПоЗаявкам.ЗначениеПоказателя КАК ЗначениеПоказателя,
		|	ВТ_УсловияПоиска.ЗаявкаНаПеревозку КАК ЗаявкаНаПеревозку,
		|	ВТ_УсловияПоиска.ТранспортныйДокумент КАК ТранспортныйДокумент
		|ПОМЕСТИТЬ ВТ_ПоказателиВнешнейПробы
		|ИЗ
		|	ВТ_УсловияПоиска КАК ВТ_УсловияПоиска
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ВнешниеПробыПоЗаявкамНаПеревозку КАК ВнешниеПробыПоЗаявкам
		|		ПО (ВнешниеПробыПоЗаявкам.ВидПеревозки = ВТ_УсловияПоиска.ВидПеревозки)
		|			И (ВнешниеПробыПоЗаявкам.Номенклатура = ВТ_УсловияПоиска.Номенклатура)
		|			И (ВнешниеПробыПоЗаявкам.ДатаПогрузки = ВТ_УсловияПоиска.ДатаДокументаПоставщика)
		|			И (ВнешниеПробыПоЗаявкам.ВесБрутто = ВТ_УсловияПоиска.ВесБрутто)
		|			И (ВнешниеПробыПоЗаявкам.НомерЗерновоза ПОДОБНО &ПолеПоискаНомерЗерновоза)
		|ГДЕ
		|	ВнешниеПробыПоЗаявкам.НазначениеИспользованияКачества = &ВидВнешнейПробы";
		
КонецПроцедуры	
	
#КонецОбласти
